#+title: Lesson 01 — SELECT Basics
#+property: header-args:python :session *bq* :results output :python ../.venv/bin/python

** Inspect the raw SQL
#+begin_src python
print(load_sql("01-select-basics.sql",
               indicator_code="SE.PRM.ENRR", year=2015, limit=10))
#+end_src

#+RESULTS:
#+begin_example
-- Kaggle: bigquery-public-data.world_bank_intl_education
SELECT
    country_name,
    indicator_name,
    value
FROM
    `bigquery-public-data.world_bank_intl_education.international_education`
WHERE
    indicator_code = 'SE.PRM.ENRR'
    AND year = 2015
ORDER BY value DESC
LIMIT 10
#+end_example

** Run it
#+begin_src python :results output vector

  df = run("01-select-basics.sql",
           indicator_code="SE.PRM.ENRR", year=2015, limit=10)
  print(df.to_string())
  df.to_csv("data/enrollment-2015.csv", index=False)
#+end_src

#+RESULTS:
#+begin_example
   country_name                                  indicator_name       value
0    Madagascar  Gross enrolment ratio, primary, both sexes (%)  148.894455
1        Malawi  Gross enrolment ratio, primary, both sexes (%)  145.465775
2   Timor-Leste  Gross enrolment ratio, primary, both sexes (%)  136.843201
3         Nepal  Gross enrolment ratio, primary, both sexes (%)  135.433502
4        Rwanda  Gross enrolment ratio, primary, both sexes (%)  132.550064
5         Benin  Gross enrolment ratio, primary, both sexes (%)  128.983353
6  Sierra Leone  Gross enrolment ratio, primary, both sexes (%)  127.598938
7       Burundi  Gross enrolment ratio, primary, both sexes (%)  123.781792
8        Sweden  Gross enrolment ratio, primary, both sexes (%)  123.019188
9      Suriname  Gross enrolment ratio, primary, both sexes (%)  122.811722
#+end_example

